#პრონცენტული გაყოფა ყოფს ორ რიცხვს და გამოაქვს ნაშთი
#რიცხვის ხარისხში აყვანა ხდება ორი ფიფქით(**)
num1=5
print(num1**2)
print(13%3)
#მონაცენთა ტიპები განსაზღვრავს რა მონაცემს ინახავს ცვლადში
#სტრინგი(str)
#მთელი რიცხვი(int)
#ლოგიკური(bool)
#წილადი რიცხვი(float)

#str არის ტეკსტის მონაცემი ჩასმული ბრჭყალებში
#int არის მთელი რიცხვები და ათწილადის გარეშე
#bool არის ჭესმარიტი და მცდარი
#float არის ათწილადი წილადი რიცხვები და არ აქვს მთელი რიცხვები

name='dachi'
age=11
surename="kvinikadze"
print(name)
print(age)
print(surename)

name='io'
age=10
hieght=1.58
