#1. While loop-ის გამოყენებით გამოიტანეთ 20-დან 1-მდე რიცხვები.
#2. გამოიტანეთ 1-დან 50-მდე მხოლოდ ლუწი რიცხვები.
#3. გამოიტანეთ 1-დან 100-მდე რიცხვები, რომლებიც იყოფა 5-ზე.
#4. მომხმარებელს შემოატანინეთ რიცხვი და while loop-ის გამოყენებით გამოიტანეთ 1-დან ამ რიცხვამდე ყველა რიცხვი
#5. მომხმარებელს შემოატანინეთ რიცხვი და გამოიტანეთ 1-დან ამ რიცხვამდე მხოლოდ კენტი რიცხვები.
#6. მომხმარებელს შემოატანინეთ პაროლი. სანამ პაროლი არ იქნება "python123", მანამდე მომხმარებელს თავიდან შეაყვანინეთ პაროლი.
w=1
while w<=20:
    print(w)
    w+=1

e=1
while e<=50:
    print(e)
    e+=2

r=0
while r<=100:
    print(r)
    r+=5

num=int(input("enter youre num:"))
t=1
while t<=num:
    print(t)
    t+=1

num=int(input("enter youre num:"))
y=1
while y<=num:
    print(y)
    y+=2

