#1.while loop-ის გამოყენებით გამოთვალეთ 1-დან 100-მდე ყველა რიცხვის ჯამი. გამოიყენეთ total ცვლადი.

#2.while loop-ის გამოყენებით გამოთვალეთ 1-დან 100-მდე ყველა კენტი რიცხვის ჯამი.

#3.while loop-ის გამოყენებით გამოიტანეთ რიცხვები 1-დან 50-მდე. როდესაც რიცხვი გახდება 25, გამოიყენეთ break და გააჩერეთ ციკლი.

#4.მომხმარებელს შეაყვანინეთ რიცხვები. სანამ მომხმარებელი არ შეიყვანს 0-ს, დაამატეთ რიცხვები total ცვლადში. 0-ის შეყვანისას გამოიყენეთ break და ბოლოს გამოიტანეთ ჯამი.

#5.მომხმარებელს შემოატანინეთ რიცხვი n და while loop-ის გამოყენებით გამოთვალეთ 1-დან n-მდე ყველა ლუწი რიცხვის ჯამი.

#6.მომხმარებელს შეაყვანინეთ რიცხვები. თუ მომხმარებელი შეიყვანს უარყოფით რიცხვს, გამოიყენეთ break. დადებითი რიცხვები დაამატეთ total ცვლადში და ბოლოს გამოიტანეთ ჯამი.

#7.მომხმარებელს შეაყვანინეთ რიცხვები. თუ შეიყვანს 0-ს, გამოიყენეთ break. ყველა დადებითი რიცხვი დაამატეთ total ცვლადში, ხოლო უარყოფითი რიცხვები გამოტოვეთ

w=1
while w<=100:
    print(w)
    w+=1 

e=1
while e<=100:
    print(e)
    e+=2

